Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
		uint32_t ClockHz = CLOCK_GetRootClockFreq (FlexSPIClock);
	#else
		#error "unknon controller family"
	#endif
	DeviceConfig.flexspiRootClk = ClockHz;

	// Get FLEXSPI default settings and configure the FlexSPI.
	flexspi_config_t config {};
	FLEXSPI_GetDefaultConfig (&config);

	// Need to set the combination-enable option. This options combines 8 data lines from FlexSPI channel A with
	// 4 data lines from FlexSPI channel B to form an 8-line bus for octal. On this SoC this is the only way to enable octal.
	#if !(defined(FSL_FEATURE_FLEXSPI_HAS_NO_MCR0_COMBINATIONEN) && FSL_FEATURE_FLEXSPI_HAS_NO_MCR0_COMBINATIONEN)
		config.enableCombination          = (MemType == MemType_OctaSPI_DDR || MemType == MemType_OctaSPI);	// Only true when using Octa-Mode
	#endif
	config.ahbConfig.enableAHBPrefetch    = true;	// Enable AHB prefetching
	config.ahbConfig.enableAHBBufferable  = true;
	config.ahbConfig.enableReadAddressOpt = true;
	config.ahbConfig.enableAHBCachable    = true;
	config.rxSampleClock                  = kFLEXSPI_ReadSampleClkLoopbackInternally;

	FLEXSPI_Init           (base, &config);
	FLEXSPI_SetFlashConfig (base, &DeviceConfig, FlexSPI_Helper::port);   // Configure flash settings according to serial flash feature.
	FLEXSPI_UpdateLUT      (base, 0, &Generic::LUT_SPI.front(), Generic::LUT_SPI.size()); // Update LUT table
	FLEXSPI_SoftwareReset  (base);                                        // Do software reset.

	// Get the JEDEC Informations
	DeviceInfo info {};
	status_t status {};
	static const std::array<status_t (*) (FlexSPI_Helper &, DeviceInfo &), 3> JedecReader
	{
		[](FlexSPI_Helper &b, DeviceInfo &i){return b.ReadJEDEC (&i);},
		Macronix::TryDetect,
		ISSI::TryDetect
	};
	for (auto reader : JedecReader)
	{
		status = reader (*base, info);
		if (status == kStatus_Success && info.ManufactureID != ManufactureID_UNDEF)
			break;
	}

	if (status != kStatus_Success || info.ManufactureID == ManufactureID_UNDEF)
	{
		DebugPrint ("JEDEC read Error\r\n");
		return LibmemStaus_InvalidDevice;
	}

	// Check for the Manufacture-ID and adapt the Configuration
	LibmemStatus_t res = LibmemStaus_Success;
	switch (info.ManufactureID)
	{
		case ManufactureID_AdestoTechnologies:
		case ManufactureID_Atmel:		// Renesas
			res = Adesto::Initialize (*base, MemType, info, config, DeviceConfig);
			break;
		case ManufactureID_Nexcom:		// Winbond
			res = Winbond::Initialize (*base, MemType, info, config, DeviceConfig);
			break;
		case ManufactureID_Macronix:	// Macronix
			res = Macronix::Initialize (*base, MemType, info, config, DeviceConfig);
			break;
		case ManufactureID_Lucent:		// ISSI
			res = ISSI::Initialize (*base, MemType, info, config, DeviceConfig);
			break;
		default:
			DebugPrint ("unknown Flash-memory\r\n");
			return LibmemStaus_InvalidDevice;
	}

	if (res != LibmemStaus_Success)
		return res;

	// Reconfigure the interface according to the gathered flash information and configuration
	if (MemType == MemType_OctaSPI_DDR || MemType == MemType_QuadSPI_DDR)
	{
		#if (defined(MIMXRT533S_SERIES)   || defined(MIMXRT555S_SERIES) || defined(MIMXRT595S_cm33_SERIES))
			ClockDiv = 2;
			if (base == FLEXSPI0)
			{
				CLKCTL0->FLEXSPI0FCLKDIV = CLKCTL0_FLEXSPI0FCLKDIV_DIV(ClockDiv - 1);
				while ((CLKCTL0->FLEXSPI0FCLKDIV) & CLKCTL0_FLEXSPI0FCLKDIV_REQFLAG_MASK)
					;
				DeviceConfig.flexspiRootClk = CLOCK_GetFlexspiClkFreq (0);
			}
			else if (base == FLEXSPI1)
			{
				CLKCTL0->FLEXSPI1FCLKDIV = CLKCTL0_FLEXSPI1FCLKDIV_DIV(ClockDiv - 1);
				while ((CLKCTL0->FLEXSPI1FCLKDIV) & CLKCTL0_FLEXSPI1FCLKDIV_REQFLAG_MASK)
					;
				DeviceConfig.flexspiRootClk = CLOCK_GetFlexspiClkFreq (1);
			}
			else
				return LibmemStaus_Error;
			config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackInternally; // To achieve high speeds - always use DQS
		#elif (defined(MIMXRT633S_SERIES) || defined(MIMXRT685S_cm33_SERIES))
			ClockDiv = 9;
			CLKCTL0->FLEXSPIFCLKDIV = CLKCTL0_FLEXSPIFCLKDIV_DIV(ClockDiv - 1);
			while ((CLKCTL0->FLEXSPIFCLKDIV) & CLKCTL0_FLEXSPIFCLKDIV_REQFLAG_MASK)
				;
			DeviceConfig.flexspiRootClk = CLOCK_GetFlexspiClkFreq ();
			config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackInternally; // To achieve high speeds - always use DQS
		#elif (defined(MIMXRT1011_SERIES) || defined(MIMXRT1015_SERIES) || defined(MIMXRT1021_SERIES) || defined(MIMXRT1024_SERIES) || \
			   defined(MIMXRT1041_SERIES) || defined(MIMXRT1042_SERIES) || defined(MIMXRT1051_SERIES) || defined(MIMXRT1052_SERIES) || \
			   defined(MIMXRT1061_SERIES) || defined(MIMXRT1062_SERIES) || defined(MIMXRT1064_SERIES))
			ClockDiv = 2;
			CLOCK_SetDiv (FlexSPIDiv, ClockDiv-1);	// flexspi clock divide by two --> 240 Mz.
			DeviceConfig.flexspiRootClk = SourceClock_Hz / ClockDiv;
			DeviceConfig.flexspiRootClk = ClockHz;
		#elif (defined(MIMXRT1165_cm7_SERIES) || defined(MIMXRT1166_cm7_SERIES) || defined(MIMXRT1165_cm4_SERIES) || defined(MIMXRT1166_cm4_SERIES) || \
			   defined(MIMXRT1171_SERIES)     || defined(MIMXRT1172_SERIES)     || \
			   defined(MIMXRT1173_cm7_SERIES) || defined(MIMXRT1175_cm7_SERIES) || defined(MIMXRT1176_cm7_SERIES) || \
			   defined(MIMXRT1173_cm4_SERIES) || defined(MIMXRT1175_cm4_SERIES) || defined(MIMXRT1176_cm4_SERIES))
			CLOCK_ControlGate (FlexSPIClockGate, kCLOCK_Off);	// The module clock must be disabled during clock switch in order to avoid glitch
			CLOCK_SetRootClockMux (FlexSPIClock, 5); // ClockSource_SysPll2 --> 528 MHz
			CLOCK_SetRootClockDiv (FlexSPIClock, 2); // --> 528 MHz / 2 = ~264 MHz
			CLOCK_ControlGate (FlexSPIClockGate, kCLOCK_On);
			DeviceConfig.flexspiRootClk = CLOCK_GetRootClockFreq (FlexSPIClock);
		#else
			#error "unknon controller family"
		#endif
		FLEXSPI_Init (base, &config); // changing the clock requires reinitialization
	}

	// Use the size information from the JEDEC-information to configure the interface
	uint32_t FlashSize = CalculateCapacity_KBytes (info.Capacity);
	DeviceConfig.flashSize = FlashSize;
	geometry[0].count = FlashSize / (4096 / 1024);
	FlashSize *= 1024;	// Convert kBytes to bytes

	FLEXSPI_SetFlashConfig (base, &DeviceConfig, FlexSPI_Helper::port);	// Configure flash settings according to serial flash feature.

