Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
/*! libmem_Flush:
The LIBMEM driver's flush function.
\param h    A pointer to the handle of the LIBMEM driver. 
\return int The LIBMEM status result */
static int libmem_Flush (libmem_driver_handle_t *h)
{
	DebugPrint ("libmem_Flush\r\n");
	LibmemDriver *driver = static_cast<LibmemDriver *>(h);
	return libmem_driver_paged_write_flush (h, &driver->PageWriteControlBlock);
}

/*! libmem_Read:
The LIBMEM driver's read extended function.
\param h    A pointer to the handle of the LIBMEM driver.
\param dest A pointer to the initial memory address to write data to.
\param src  A pointer to the initial memory address in the memory range handled by the driver to read data from.
\param size The number of bytes to write.
\return int The LIBMEM status result */
static int libmem_Read (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
{
	DebugPrintf ("Read at 0x%x, size: %d\r\n", src, size);
	if (size == 0)
		return LibmemStaus_InvalidParameter;
//	memcpy (dest, src, size);

	flexspi_transfer_t flashXfer
	{
		(uint32_t)src,		  // Operation device address.
		FlexSPI_Helper::port, // Operation port.
		kFLEXSPI_Read,		  // Execution command type.
		LUT_ReadArray,		  // Sequence ID for command.
		1,					  // Sequence number for command.
		(uint32_t *)dest,	  // Data buffer.
		size				  // Data size in bytes.
	};

	FlexSPI_Helper *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (status != kStatus_Success)
		return status;

	return LibmemStaus_Success;
}


/*! libmem_CRC32:
The LIBMEM driver's crc32 extended function.
\param h     A pointer to the handle of the LIBMEM driver.
\param start A pointer to the start of the address range.
\param size  The size of the address range in bytes.
\param crc   The initial CRC-32 value.
\return uint32_t The computed CRC-32 value. */
static uint32_t libmem_CRC32 ([[maybe_unused]]libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc)
{
	DebugPrintf ("Calculate CRC from 0x%X, size 0x%X, calculated CRC: 0x%X\r\n", start, size, crc);
	static uint8_t page_buffer[4096];
	static constexpr size_t BufferSize = sizeof (page_buffer);

	while (size >= BufferSize)
	{
		libmem_Read(h, page_buffer, (uint8_t*)start, BufferSize);
		crc = libmem_crc32_direct(page_buffer,  BufferSize, crc);
		start += BufferSize;
		size  -= BufferSize;
	}
	if (size)
	{
		libmem_Read(h, page_buffer, (uint8_t*)start, BufferSize);
		crc = libmem_crc32_direct(page_buffer, size, crc);
	}
	return crc;
}


